==========================EDA Packages=======================================
1) Pandas: Used for Data frame applications

2) Numpy: Used for Numerical python, All math applications

3) Matplotlib: Used for plotting 

4) Seaborn: Used for plotting

5) Plotly: Used for plotting

6) Bokhe: Used for plotting

In [ ]:
==========================Machine Learning Packages============================
1) Sickit-learn: sklearn

In [ ]:
==========================Deep Learning Packages==================================

1) Tensorflow: Developed by Google

2) Keras: Developed by Google

3) Pytorch: Developed by Facebook

In [ ]:
====================Natural Language Processing (NLP)===============================

1) NLTK:  Natural Language toolkit

2) Scipy

In [ ]:
==========================BERT==========================================

1) Transformers: Hugging face (Google)

In [ ]:
=================================Google Models========================

1) Specific Google Packages

In [ ]:
================================Azure ML======================================
1) Azure packages

In [ ]:
=====================================GenAI==================================

1) Geminiai: Google

2) ChatGPT: OpenAI

In [ ]:
===============================LangChain=================================

1) LangChain packages

**create a dataframe using list**

**Create a dataframe**

In [3]:
import pandas as pd #dataframe package
names=["Avinash","Ayush","Akash"]
pd.DataFrame() #Empty dataframe will create means no rows, no coloumns

Empty DataFrame
Columns: []
Index: []

**Provide data**

In [4]:
names=["Avinash","Ayush","Akash"]
pd.DataFrame(names)

         0
0  Avinash
1    Ayush
2    Akash

In [5]:
names=["Avinash","Ayush","Akash"]
age=[30,20,25]
city=["Pune","Banglore","Hydrabad"]
pd.DataFrame(zip(names,city,age))
#first positional argument: Data
#second positional argument: Index

         0         1   2
0  Avinash      Pune  30
1    Ayush  Banglore  20
2    Akash  Hydrabad  25

**Provide coloumn names**

In [6]:
names=["Avinash","Ayush","Akash"]
age=[30,20,25]
pd.DataFrame(zip(names,age),
             columns=['Name','Age'])

      Name  Age
0  Avinash   30
1    Ayush   20
2    Akash   25

In [7]:
names=["Avinash","Ayush","Akash"]
age=[30,20,25]
city=["Pune","Banglore","Hydrabad"]

data=zip(names,age,city)
cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

     Names  Age      City
0  Avinash   30      Pune
1    Ayush   20  Banglore
2    Akash   25  Hydrabad

In [9]:
names=["Avinash","Ayush","Akash"]
age=[30,20,25]
city=["Pune","Banglore","Hydrabad"]

data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)
df

     Names  Age      City
0  Avinash   30      Pune
1    Ayush   20  Banglore
2    Akash   25  Hydrabad

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df

     Names  Age      City
0  Avinash   30      Pune
1    Ayush   20  Banglore
2    Akash   25  Hydrabad

In [13]:
df.drop('City',
        axis=1,
        inplace=True)

In [14]:
df

     Names  Age
0  Avinash   30
1    Ayush   20
2    Akash   25

In [15]:
df.drop('Age',
        axis=1)  #did not give inplace=True

     Names
0  Avinash
1    Ayush
2    Akash

In [16]:
df

     Names  Age
0  Avinash   30
1    Ayush   20
2    Akash   25

In [19]:
df1=df.drop('Age',axis=1) #if you want to delete the column then assign it to variable 
df1

     Names
0  Avinash
1    Ayush
2    Akash

In [21]:
df1

     Names
0  Avinash
1    Ayush
2    Akash

In [24]:
names=["Avinash","Ayush","Akash"]
age=[30,20,25]
city=["Pune","Banglore","Hydrabad"]

data=zip(names,age,city)
cols=['Names','Age','City']
idx=["A","B","C"]
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age      City
A  Avinash   30      Pune
B    Ayush   20  Banglore
C    Akash   25  Hydrabad

In [28]:
df

     Names  Age
A  Avinash   30
B    Ayush   20
C    Akash   25

In [30]:
df2=df.drop("Age",axis=1)
df2

     Names
A  Avinash
B    Ayush
C    Akash

In [31]:
df

     Names  Age
A  Avinash   30
B    Ayush   20
C    Akash   25

In [34]:
df.drop(["Names","Age"],axis=1,inplace=True)
df

Empty DataFrame
Columns: []
Index: [A, B, C]

In [35]:
names=["Avinash","Ayush","Akash"]
age=[30,20,25]
city=["Pune","Banglore","Hydrabad"]

data=zip(names,age,city)
cols=['Names','Age','City']
idx=["A","B","C"]
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age      City
A  Avinash   30      Pune
B    Ayush   20  Banglore
C    Akash   25  Hydrabad

In [36]:
df.drop("A",axis=0,inplace=True)
df

   Names  Age      City
B  Ayush   20  Banglore
C  Akash   25  Hydrabad

In [37]:
df

   Names  Age      City
B  Ayush   20  Banglore
C  Akash   25  Hydrabad

**How to save the dataframe**

- Generally dataframes are two types

1) CSV(Comman seperated value)
2) Excel

In [38]:
names=["Avinash","Ayush","Akash"]
age=[30,20,25]
city=["Pune","Banglore","Hydrabad"]

data=zip(names,age,city)
cols=['Names','Age','City']
idx=["A","B","C"]
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age      City
A  Avinash   30      Pune
B    Ayush   20  Banglore
C    Akash   25  Hydrabad

In [43]:
#file name= data
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False) # if you want to create another file then you need to close first opend file in background

In [42]:
#file name= data
df.to_excel('data2.xlsx')
df.to_excel('data3.xlsx',index=False)